app/controllers/store_controller.rb

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2010-06-15 20:50:33', 29.95, 2, 1, '2010-06-15 20:50:33')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Kyle', '2010-06-15 20:50:33', 'check', '170 blah drive', 'blah@yah.com', '2010-06-15 20:50:33')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save