app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('Kyle', '-6130630680.0513339959649713', '2010-06-16 14:21:26', 'c2aae105a6e82b4fe33947cf470089a46857672d', '2010-06-16 14:21:26')

  def destroy
    @user = User.find(params[:id])
    begin
	@user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1